Page({
  data: {
    basicOperations: [
      {
        title: '1.如何快速添加记录？',
        steps: [
          '①点击底部导航栏金色【＋】按钮',
          '②选择录入类型并填写信息',
          '③点击底部【保存】按钮，完成！'
        ]
      },
      {
        title: '2.如何找到历史记录？',
        steps: [
          '①点击【首页】，查看不同类型的记录',
          '②点击【统计】，查看不同年份、月份的记录',
          '③点击【联系人】，查看不同联系人的记录，并支持搜索历史记录'
        ]
      },
      {
        title: '3.如何查看记录详情？',
        steps: [
          '①选择【首页】【统计】【联系人】页的任意条目',
          '②点击任意条目就可进入记录详情',
          '③可查看单笔记录的姓名、金额、备注、图片等'
        ]
      },
      {
        title: '4.如何重新编辑记录？',
        steps: [
          '①进入记录详情页面',
          '②点击页面底部【编辑记录】按钮',
          '③即可修改已保存的记录'
        ]
      },
      {
        title: '5.删除的记录如何恢复？',
        steps: [
          '①记录删除后会进入【回收站】，可恢复 30 天内删除的内容',
          '②位置：【我的】页→【数据管理】→【回收站】',
          '③点击【回收站】右上角【管理】按钮可选择要恢复的记录'
        ]
      }
    ],
    faqs: [
      {
        question: 'Q：小程序收费吗？',
        answer: 'A：目前小程序所有功能完全免费，无任何隐藏扣费'
      },
      {
        question: 'Q：数据会丢失吗？',
        answer: 'A：不会，数据自动保存在云端，登录微信即可同步'
      },
      {
        question: 'Q：能离线使用吗？',
        answer: 'A：本小程序需要联网使用，数据实时保存在云端'
      },
      {
        question: 'Q：支持多设备同步吗？',
        answer: 'A：支持。同一个微信号登录，数据会自动同步到所有设备'
      },
      {
        question: 'Q：如何反馈意见？',
        answer: 'A：进入【我的】页，点击【意见反馈】即可反馈意见'
      }
    ]
  }
})
